import React, { useState } from 'react';
import { Link } from 'react-router-dom';
import './AboutUs.css'; // Якщо ви хочете додати стилі

function AboutUs() {
  const [showMore, setShowMore] = useState(false);

  const handleShowMoreClick = (e) => {
    e.preventDefault();
    setShowMore(!showMore); // Змінюємо стан на протилежний значенню showMore
  };

  return (
    <section className="about-us">
      <h2>Про нас</h2>
      <p>Дізнайтеся більше про нашу місію та цінності.</p>
      {
        showMore ? 
        <div>
          <p>
            Наша компанія, заснована у 2010 році, з гордістю представляє широкий асортимент безалкогольних напоїв, створених з врахуванням інноваційних технологій та екологічно чистих інгредієнтів. Ми прагнемо до створення напоїв, які не лише втамовують спрагу, а й дарують незабутні смакові враження. Наші напої — це гармонія смаку, якості та відповідальності перед природою. Від класичних коли до екзотичних фруктових напоїв — у нас є все, щоб задовольнити будь-які уподобання. 
          </p>
          <p>
            Кожен напій у нашому асортименті — це результат ретельної роботи наших фахівців, які піклуються про кожен етап виробництва, починаючи від вибору інгредієнтів до дизайну упаковки. Ми віримо, що якість — це не просто обіцянка, а наш стандарт, і ми втілюємо його в кожній пляшці. Запрошуємо вас відкрити для себе світ незабутніх смаків разом з нами!
          </p>
          <Link to="/about">Детальніше про нас</Link>
          <hr/>
          <a href="#less" onClick={handleShowMoreClick}> Згорнути</a>
        </div> : 
        <a href="#more" onClick={handleShowMoreClick}>Переглянути більше</a>
      }
    </section>
  );
}

export default AboutUs;
