import React from 'react';
import './About.css'; // Переконайтеся, що ви створили цей CSS файл
import { Link } from 'react-router-dom';

const About = () => {
  return (
    <div className="about-container">
      <section className="about-hero">
        <h1>Вітаємо у Нашому Світі Натуральних Напоїв!</h1>
        <p>Відкрийте для себе нові смаки та аромати безалкогольних напоїв.</p>
      </section>

      <section className="about-story">
        <h2>Наша Історія</h2>
        <p>Заснований у 2020 році, наш магазин безалкогольних напоїв народився з бажання пропонувати альтернативу традиційним напоям. Ми віримо, що кожен заслуговує на вишукані та оригінальні смакові відчуття, незалежно від обставин.</p>
      </section>

      <section className="about-mission">
        <h2>Наша Місія</h2>
        <p>Наша місія - змінити сприйняття безалкогольних напоїв, пропонуючи якісні, натуральні та смачні варіанти, які задовольнять будь-який смак.</p>
      </section>

      <section className="about-values">
        <h2>Наші Цінності</h2>
        <ul>
          <li><strong>Якість:</strong> Ми вибираємо лише найкращі натуральні інгредієнти.</li>
          <li><strong>Інновації:</strong> Постійний пошук нових смаків та ексклюзивних рецептур.</li>
          <li><strong>Відповідальність:</strong> Підтримка сталого розвитку та екологічних практик.</li>
        </ul>
      </section>

      <section className="about-team">
        <h2>Зустрічайте Нашу Команду</h2>
        <p>Наша команда - це група ентузіастів, які палко вірять у цінність та значення якісних безалкогольних напоїв.</p>
    
      </section>

      <section className="about-contact">
        <h2>Зв'яжіться з Нами</h2>
        <p>Маєте запитання або пропозиції? Не вагайтеся зв'язатися з нами через наші контакти.</p>
    
      </section>
    </div>
  );
};

export default About;
